mprubi/Wifi-Controlled-Car-TI-MSP430FR2355/interrupt_timers.c
// This file is for timer operation
#include  "functions.h"
#include  "msp430.h"
#include <string.h>
#include "macros.h"

//extern volatile int Time_Seq_Reset_Count = 0;
//extern volatile unsigned char update_display;
//extern volatile unsigned char update_display_timer = 0;
//extern volatile unsigned int Time_Sequence = 0;

//proving my adc setup
extern volatile unsigned int ADC_Thumb,
                             ADC_Left_Sensor,
                             ADC_Right_Sensor,
                             left_sensor_mov_average,
                             right_sensor_mov_average;
extern char display_line[4][11];
extern char *display[4];
//extern unsigned char display_mode;
extern volatile unsigned char display_changed;
extern volatile char adc_char[12],
                     bang;
//extern volatile unsigned char start_process = 0;
extern unsigned int speed_global,
                    travel_time_seconds;
volatile char from_forward,
              from_reverse,
              activate_travel_time = FALSE,
              activate_adc_readings = FALSE;

extern int black_line_edge_threshold ;
extern unsigned int speed_global;

extern unsigned int speed_correction;


//volatile char one_second_from_fifty_msec_count = 0;
//volatile char one_second_delay = FALSE;
volatile char time_seconds = 0,
             time_half_seconds = 0,
//             Tx_message_timer = 0,
             FET_delay_timer = 0,
//             PID_enable_timer = 0,
             open_TCP_port_timer = 0,
             travel_time_inrementer = 0,
             activate_open_TCP_port_timer = FALSE,
             activate_pivot_timer = FALSE,
             pivot_timer = 0,
             IoT_reset_timer = 0;
extern volatile char observe_control_system;
volatile char PID_control_enabled = FALSE;
extern char current_state,
            previous_state;
extern volatile char startup_okay_to_TX;
volatile extern char USB_Tx_Outgoing_Buff[LARGE_RING_SIZE_32];

extern char current_state,
            previous_state;

//extern long debug_follow_black_line_counter, 
//      debug_observe_control_system_counter,
//      debug_control_signal_calc_counter;


extern int debug_L_BLACK[DEBUG_ARR_SIZE],
           debug_R_BLACK[DEBUG_ARR_SIZE],
           debug_L_SPEED[DEBUG_ARR_SIZE],
           debug_R_SPEED[DEBUG_ARR_SIZE],
           debug_Control[DEBUG_ARR_SIZE];
extern int debug_scroller;
extern volatile char UCA1_index;

//extern const char *Tx_queue_USB[6],
//                  *Tx_queue_IoT[6];
//extern char usb_msg_queue_incrementer,
//            iot_msg_queue_incrementer;


/* Various Timer related notes
Two interrupt vectors are associated with the 16 bit
Timer _B module:
– TBxCCR0 interrupt vector for TBxCCR0 CCIFG
– TBxIV interrupt vector for all other CCIFG flags and TBIFG

-In capture mode, any CCIFG flag is set when a timer
value is captured in the associated TBxCCRn register

-In compare mode, any CCIFG flag is set if TBxR counts
to the associated TBxCCRn value Software may also
set or clear any CCIFG flag All CCIFG flags request an
interrupt when their corresponding CCIE bit and the
GIE bit are set

(reason why each Timer_Bx has two ISR's associated with them)
The TBxCCR0 CCIFG flag has the highest Timer _B
interrupt priority and has a dedicated interrupt vector.The TBxCCR0 CCIFG flag is automatically reset when
the TBxCCR0 interrupt request is serviced.

These functions determine what I'm going to do when
the timers expire, triggering an interrupt

Rule of thumb: don't have a faster timer than what you need and use it to count
up to slower times if the fast timer is completely unused

*/


//TODO: TB0 CC0 is for the update display and other similar order timers
// TB0 CCR1 and CCR 2 could be for debouncing SW1 and SW2
// TB1 can be used for the order of 50 miliseconds (going forward and reverse?)
//     CCR0 using SMCLK again
//TB2 can be on the order of seconds, using ACLCK as the source
// use this clock with 5 or 10 seconds to avoid having to send IoT commands
// every 1 second to go across atrium floor

// ACLK will be good for obtaining minutes to turn on LED on wifi module to indicate
//whether it's received a command in the last minute or not

#pragma vector = TIMER_B0_CCR_0_VECTOR
__interrupt void TIMER_B0_CCR_0_ISR(void){
  // IV (Interrupt Vector) for TimerB0 CCRO
  //Usage of these vectors is to derive any number of
  // additional timing elements (variables) for different applications in the program
  TB0CCR0 += CCR0_16_MSEC_INTERVAL; // Add Offset to TBCCR0

    //GREEN_LED_TOGGLE();
}

#pragma vector= TIMER_B0_CCR_1_2_OVFL_VECTOR
__interrupt void TIMER_B0_CCR_1_2_OVFL_ISR(void){

  // IV (Interrupt Vector) for TimerB0 CCR1, CCR2, and OFVL

  switch(__even_in_range(TB0IV, 14)){
  case 0:
    break; // No interrupt
  case 2:
    TB0CCR1 += TB0_SEC_0_100; //increment timer
    TB0CCTL1 &= ~CCIE; //disable timer

    //debug actions
    //BACKLIGHT_TOGGLE();
    //GREEN_LED_TOGGLE();

    P4IE |= SW1;  // re-enable SW1 via "Interrupt Enable" bit
    P4IFG &= ~SW1; // 2) clear SW1 associated flags

    break;
  case 4:
    TB0CCR2 += TB0_SEC_0_100; //increment timer

    TB0CCTL2 &= ~CCIE; //disable timer

    //debug actions
    //BACKLIGHT_TOGGLE();
    //RED_LED_TOGGLE();

    //after this timer interrupt triggers (TB0_SEC_1_250 later),
    // re-enable switch interrupts so they can be reused

    P2IE |= SW2;  // 1) "Interrupt Enable" bit
    P2IFG &= ~SW2; // 2) IFG SW1 cleared

    break;
  case 14: // overflow
    P3OUT |= IOT_RESET;  // Set IOT_RESET Inactive [high]  (release IOT module from reset mode on startup)
    //TB0CTL &= ~TBIE;      // Timer B0 overflow interrupt disable
    break;
  default:
    break;
  }
  //
}

#pragma vector = TIMER_B1_CCR_0_VECTOR
__interrupt void TIMER_B1_CCR_0_ISR(void){
  // TimerB1 0 Interrupt handler

  TB1CCR0 += TB1_SEC_0_200; // Add Offset to TBCCR0

  IoT_reset_timer++;
  //BACKLIGHT_TOGGLE();  //debug


 // IoT Reset
  if(IoT_reset_timer > 2){
    P3OUT |= IOT_RESET;
  }

  if(activate_pivot_timer == TRUE){
      pivot_timer++;
      if(pivot_timer == 2){
        pivot_timer  = 0;
        activate_pivot_timer = FALSE;
        stop_car();
      }
    }

  if(activate_adc_readings == TRUE){
    GREEN_LED_TOGGLE();
    // update display with hex values from ADC
    //ADCCTL0 |= ADCENC;
    //  HEXtoBCD(ADC_Left_Sensor);
//    HEXtoBCD(left_sensor_mov_average);
//    adc_line(0,6);
//
//    //  HEXtoBCD(ADC_Right_Sensor);
//    HEXtoBCD(right_sensor_mov_average);
//    adc_line(0,0);
//
////  HEXtoBCD(black_line_edge_threshold);
//    HEXtoBCD(black_line_edge_threshold);
//    adc_line(1,0);
////  HEXtoBCD(speed_global);
//    HEXtoBCD(speed_global);
//    adc_line(2,0);
////  HEXtoBCD(speed_correction);
//    HEXtoBCD(speed_correction);
//    adc_line(3,0);
    
    // --------------------------
    //Lost display functionality, writing values to terminal instead
    
//    HEXtoBCD(left_sensor_mov_average, right_sensor_mov_average);
//    
//    TX_message_USB_UCA1(adc_char);


//    HEXtoBCD(ADC_Thumb);
//    adc_line(2,6);
//
//    strcpy(display_line[3], "Thumb:");
//    update_string(display_line[2], 3);

//    display_changed = 1;
  }
}

#pragma vector = TIMER_B1_CCR_1_2_OVFL_VECTOR
__interrupt void TIMER_B1_CCR_1_2_OVFL_ISR(void){
  switch(__even_in_range(TB1IV, 14)){
  case 0:
    break; // No interrupt
  case 2:
    //30 msec timer here (for ADC measurements)
    TB1CCR1 += TB1_SEC_0_030;
    //RED_LED_TOGGLE();

    //BACKLIGHT_TOGGLE();  //debug
    
//    if (debug_scroller++ > DEBUG_ARR_SIZE){
//      debug_scroller = 0;
//    }
//    
//    
//    debug_L_BLACK[debug_scroller] = ;
//    debug_R_BLACK[debug_scroller] = ;
//    debug_L_SPEED[debug_scroller] = ;
//    debug_R_SPEED[debug_scroller] = ;
//    debug_Control[debug_scroller] = ;
//    
//  
          
    if(activate_adc_readings == TRUE){
      ADC_CONVERSION_ENABLE();
//      ADCCTL0 |= ADCENC;
      observe_control_system = TRUE;
      RED_LED_TOGGLE();
      
      //---- Display ADC mov average readings (previous)
      HEXtoBCD(left_sensor_mov_average, right_sensor_mov_average);
      
      UCA1_index = 0;
      
      // 0 to 11
      for(int i = 0; i < sizeof(adc_char); i++){
        USB_Tx_Outgoing_Buff[i] = adc_char[i];
      }
      
     
      //---- Display wheel speeds 
      int convert_left = LEFT_FORWARD_SPEED, 
          convert_right = RIGHT_FORWARD_SPEED;
      char display_current_state_array[6],
           display_previous_state_array[6];
      
      HEXtoBCD(convert_left, convert_right);
      
      // 12 to 22
      for(int i = 12, j = 0; i < 24; i++, j++){
        USB_Tx_Outgoing_Buff[i] = adc_char[j];
      }
      
       //---- State information
      switch(previous_state){
      case OFF_LINE:
        strcpy(display_previous_state_array, "OFF  ");
        break;
      case ON_LINE:
        strcpy(display_previous_state_array, "ON  ");
        break;
      case LEFT_OF_LINE:
        strcpy(display_previous_state_array, "LEFT");
        break;
      case RIGHT_OF_LINE:
        strcpy(display_previous_state_array, "RIGHT");
        break;
      }
      
      switch(current_state){
      case OFF_LINE:
        strcpy(display_current_state_array, "OFF  ");
        break;
      case ON_LINE:
        strcpy(display_current_state_array, "ON  ");
        break;
      case LEFT_OF_LINE:
        strcpy(display_current_state_array, "LEFT");
        break;
      case RIGHT_OF_LINE:
        strcpy(display_current_state_array, "RIGHT");
        break;
      }
      
      // 24 to 32
      for(int i = 24, j = 0; i < 28; i++, j++){
        USB_Tx_Outgoing_Buff[i] = display_current_state_array[j];
      }
      
      USB_Tx_Outgoing_Buff[28] = CARRIAGE_RETURN;
      USB_Tx_Outgoing_Buff[29] = LINE_FEED;
      
      
      // Null the rest of Buffer 
      for(int i = 30; i < sizeof(USB_Tx_Outgoing_Buff); i++){
        USB_Tx_Outgoing_Buff[i] = NULL_CHAR;
      }
      
      
      //    strncpy(USB_Tx_Outgoing_Buff, message, 10);
      UCA1IE |= UCTXIE; // enable the Tx interupt
      UCA1TXBUF = USB_Tx_Outgoing_Buff[UCA1_index++];
    }
    
    break;
  case 4:
    //50 msec timer here
    TB1CCR1 += TB1_SEC_0_050;
    //GREEN_LED_TOGGLE();

    break;
  case 14: // overflow
    break;
  default:
    break;
  }
}

#pragma vector = TIMER_B2_CCR_0_VECTOR
__interrupt void TIMER_B2_CCR_0_ISR(void){
  // TimerB2 0 Interrupt handler

  TB2CCR0 += TB2_MIN_0_005; // Half second offset
  time_half_seconds++;
  
//  HEXtoBCD(left_sensor_mov_average, right_sensor_mov_average);
//  
//  UCA1_index = 0;
//  
//  for(int i = 0; i < sizeof(adc_char); i++){
//    USB_Tx_Outgoing_Buff[i] = adc_char[i];
//  }
//  
//  for(int i = sizeof(adc_char); i < sizeof(USB_Tx_Outgoing_Buff); i++){
//    USB_Tx_Outgoing_Buff[i] = NULL_CHAR;
//  }
//  
//  //    strncpy(USB_Tx_Outgoing_Buff, message, 10);
//  UCA1IE |= UCTXIE; // enable the Tx interupt
//  UCA1TXBUF = USB_Tx_Outgoing_Buff[UCA1_index++];
  
  //  TX_message_USB_UCA1(adc_char);

  //RED_LED_TOGGLE();
}

#pragma vector = TIMER_B2_CCR_1_2_OVFL_VECTOR
__interrupt void TIMER_B2_CCR_1_2_OVFL_ISR(void){
  switch(__even_in_range(TB2IV, 14)){
  case 0:
    break; // No interrupt
  case 2: // CCR1
    TB2CCR1 += 512; // one second offset
    //TB2CCTL1 &= ~CCIFG; // 3) clear any possible pending interrupt flags
    //TB2CCTL1 &= ~CCIE; // disable timer until I need it again
    //(inside a counter for multiple seconds)

    //NOTE: MISTAKE: TB2CCR2 in case 4 was incorrectly named TB2CCR1,
    //and set to different interval, effectively halting CCR1 interrupt periodically
    time_seconds++;
    FET_delay_timer++;
//    PID_enable_timer++;

//    Tx_message_timer++;
    //RED_LED_TOGGLE();

    // this timer is to delay switching of wheel directions
    if(time_seconds != FET_delay_timer){ // Warning[Pa082]: undefined behavior: the order of volatile accesses is undefined in this statement

      if(from_forward == TRUE){
        FET_delay_timer = time_seconds; //turn timer back off
        from_forward = FALSE;
        forward(speed_global, STRAIGHT, 0);
      }
      if(from_reverse == TRUE){
        FET_delay_timer = time_seconds; //turn timer back off
        from_reverse = FALSE;
        reverse(speed_global);
      }
    }

    // timer to start PID selection
//    if(PID_enable_timer != time_seconds){
//      PID_enable_timer = time_seconds; // reset counter after 1 second
//      if(PID_control_enabled){
//        PID_control_enabled = FALSE;
//        stop_car();
//
//      }else PID_control_enabled = TRUE;
//    }

    //this timer is to send a message queue periodically
//    if(Tx_message_timer == time_seconds){
//      Tx_message_timer = time_seconds + 2;
//      TX_message_USB_UCA1(Tx_queue_USB[usb_msg_queue_incrementer++]);
//
//      if(usb_msg_queue_incrementer > 5){
//        usb_msg_queue_incrementer  = 0;
//      }
//    }

    //this timer is to open a TCP port after Wifi module has connected
    if(activate_open_TCP_port_timer == TRUE){
      open_TCP_port_timer++;
      GREEN_LED_TOGGLE();
      if(open_TCP_port_timer == 4){
        startup_okay_to_TX = TRUE;
      }
      if(open_TCP_port_timer == 10){
        BACKLIGHT_TOGGLE();
        TX_message_IoT_UCA0("AT+NSTCP=3167,1\r"); // open port 1030
      }
      if(open_TCP_port_timer == 14){
        BACKLIGHT_TOGGLE();
        open_TCP_port_timer  = 0;
        activate_open_TCP_port_timer = FALSE;
        TX_message_IoT_UCA0("AT+WSYNCINTRL=65535\r");
      }// when idle, keep TCP port open for as long as possible
    }

    //this timer is for motor travel for a specified amount of time
    if(activate_travel_time == TRUE){
      travel_time_inrementer++;
      if(travel_time_inrementer == travel_time_seconds){
        travel_time_inrementer  = 0;
        travel_time_seconds = 0;
        activate_travel_time = FALSE;
        stop_car();
      }
    }
    break;
  case 4: //CCR2
    TB2CCR2 += TB2_MIN_1_000; // one minute

// periodically ping google to force use of ncsu network before they kick me off for inactivity
    //BACKLIGHT_TOGGLE();
    if(time_seconds >= 15){
    //TX_message_IoT_UCA0("AT+PING=www.google.com,2\r");  // Home network does not require ping
    }

    break;
  case 14: // overflow
    break;
  default:
    break;
  }
}

//Prcessor won't see this ISR because TB3 is a special purpose timer for PWM
// which operates on sepparate hardware, therefore, main won't even see the ISR


// Used to reside in TB0 CCR0 with 16 msec interrupt
//  Time_Seq_Reset_Count++;
//  Time_Sequence++;
//  if(Time_Seq_Reset_Count == 250){
//    Time_Sequence = 0;
//    Time_Seq_Reset_Count = 0;
//  }

//  // Use for reference on how to derive other time intervals from a timer
//  project_5_timer++;
//  update_display_timer++;
//  if(project_5_timer == 30){
//    P6OUT ^= LCD_BACKLITE;
//    project_5_timer = 0;
//    project_5_Seconds++;  //this incrementation gave me seconds
//  }

//  //keep for reference on how to refresh display variable. Used to reside in TB0 CCR1 with 10 mSec interrupt
//    update_display_timer++;
//    if(update_display_timer == 20){  // equates to every 200 msec WHEN interrupt occurs every 10 msec
//      update_display_timer = 0;
//      update_display = 1;
//    }
